Tekla.Structures.ModelInternal.dotRebarStrand_t
Serialization structure for RebarStrand.

Tekla.Structures.ModelInternal.dotRebarStrand_t.Reinforcement
The base class for all reinforcements.

Tekla.Structures.ModelInternal.dotRebarStrand_t.PullPerStrand
Pull per strand (N).

Tekla.Structures.ModelInternal.dotRebarStrand_t.nPatterns
The number of patterns.

Tekla.Structures.ModelInternal.dotRebarStrand_t.nPointsInPattern
The number of points in each pattern.

Tekla.Structures.ModelInternal.dotRebarStrand_t.aX
The x-coordinates of all points.

Tekla.Structures.ModelInternal.dotRebarStrand_t.aY
The y-coordinates of all points.

Tekla.Structures.ModelInternal.dotRebarStrand_t.aZ
The z-coordinates of all points.

Tekla.Structures.ModelInternal.dotRebarStrand_t.nUnbondings
The number of unbondings.

Tekla.Structures.ModelInternal.dotRebarStrand_t.aStrandIndex
Indexes of the strands.

Tekla.Structures.ModelInternal.dotRebarStrand_t.aFromStart
Unbondings from the start of the strand for each strand.

Tekla.Structures.ModelInternal.dotRebarStrand_t.aMiddleToStart
Unbondings from middle of the strand
to the start of the strand for each strand.

Tekla.Structures.ModelInternal.dotRebarStrand_t.aMiddleToEnd
Unbondings from middle of the strand to the end of the
each strand.

Tekla.Structures.ModelInternal.dotRebarStrand_t.aFromEnd
Unbondings from end of the each strand.

Tekla.Structures.ModelInternal.dotRebarStrand_t.StartPoint
Startpoint of the strand.

Tekla.Structures.ModelInternal.dotRebarStrand_t.EndPoint
Endpoint of the strand.